myapp/app/controllers/products_controller.rb

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "user_id", "description", "created_at", "updated_at") VALUES('cute puppy', NULL, 'it''s cute', '2018-07-16 09:16:09', '2018-07-16 09:16:09')