myapp/app/controllers/registrations_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("name", "password_hash", "created_at", "updated_at") VALUES('ynon', '$2a$10$bBZ01QeGSL.FU0D/T9L3XO25V0PxnQXFsVF2S8PcmXxFdutVdX30.', '2018-07-16 08:15:23', '2018-07-16 08:15:23')