myapp/app/controllers/sessions_controller.rb

SELECT * FROM "users" WHERE ("users"."name" = 'foo') LIMIT 1
---
  def create
    @user = User.new(params[:user])
    db_user = User.find_by_name(@user.name)